---
type: RebarCoverType
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 3
tags: [revit-api, class]
---

# RebarCoverType

`Autodesk.Revit.DB.Structure.RebarCoverType` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `public static RebarCoverType Create ( Document doc , string name , double coverDistance )` |
| Property | CoverDistance | — | `public double CoverDistance { get ; set ; }` |
| Property | Parameter | — | `` |